slash-tzf/ESP32_MQTT/main/http_server/modem_http_config.c
    // 设置HTTP状态码
    esp_err_t ret = httpd_resp_set_status(req, HTTPD_200);
    ESP_ERROR_CHECK(ret);
    
    // 设置HTTP内容类型
    ret = httpd_resp_set_type(req, HTTPD_TYPE_JSON);
    ESP_ERROR_CHECK(ret);
    
    // 发送响应
    ret = httpd_resp_send(req, json_str, size);
    ESP_LOGD(TAG, "%s", json_str);
    free(json_str);
    ESP_ERROR_CHECK(ret);
    
    return ESP_OK;
}

static esp_err_t wifi_sta_get_handler(httpd_req_t *req)
{
    // 检查权限
    if (basic_auth_get(req) != ESP_OK) {
        return ESP_FAIL;
    }

    // 重定向到静态HTML文件
    httpd_resp_set_status(req, "302 Found");
    httpd_resp_set_hdr(req, "Location", "/wifi_sta.html");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t wifi_sta_post_handler(httpd_req_t *req)
{
    // 检查权限
    if (basic_auth_get(req) != ESP_OK) {
        return ESP_FAIL;
    }
    
    // 获取POST数据
    char *buf = malloc(1024);
    if (buf == NULL) {
        ESP_LOGE(TAG, "内存分配失败");
        return ESP_FAIL;
    }
    
    int total_len = req->content_len;
    int cur_len = 0;
    int received = 0;
    
    if (total_len >= 1024) {
        ESP_LOGE(TAG, "内容太长");
        free(buf);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "内容太长");
        return ESP_FAIL;
    }
    
    while (cur_len < total_len) {
        received = httpd_req_recv(req, buf + cur_len, total_len - cur_len);
        if (received <= 0) {
            ESP_LOGE(TAG, "接收数据失败");
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "接收数据失败");
            return ESP_FAIL;
        }
        cur_len += received;
    }
    buf[total_len] = '\0';
    
    ESP_LOGI(TAG, "收到的WiFi配置数据: %s", buf);
    
    // 解析SSID和密码
    char ssid[33] = {0};
    char password[65] = {0};
    
    char *ssid_ptr = strstr(buf, "ssid=");
    char *password_ptr = strstr(buf, "password=");
    
    if (ssid_ptr) {
        ssid_ptr += 5; // 跳过 "ssid="
        char *end = strchr(ssid_ptr, '&');
        if (end) {
            strncpy(ssid, ssid_ptr, end - ssid_ptr);
        } else {
            strcpy(ssid, ssid_ptr);
        }
    }
    
    if (password_ptr) {
        password_ptr += 9; // 跳过 "password="
        char *end = strchr(password_ptr, '&');
        if (end) {
            strncpy(password, password_ptr, end - password_ptr);
        } else {
            strcpy(password, password_ptr);
        }
    }
    
    free(buf);
    
    // URL解码
    char decoded_ssid[33] = {0};
    char decoded_password[65] = {0};
    
    url_decode(ssid, decoded_ssid);
    url_decode(password, decoded_password);
    
    ESP_LOGI(TAG, "解析的WiFi配置 - SSID: %s", decoded_ssid);
    
    // 保存配置并尝试连接
    esp_err_t ret = network_manager_set_wifi_config(decoded_ssid, decoded_password);
    
    // 返回JSON结果
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    
    if (ret == ESP_OK) {
        httpd_resp_sendstr(req, "{\"status\":\"success\",\"message\":\"WiFi配置已保存并尝试连接\"}");
    } else {
        httpd_resp_sendstr(req, "{\"status\":\"error\",\"message\":\"保存WiFi配置失败\"}");
    }
    
    return ESP_OK;
}

// 添加网络模式获取API
static esp_err_t network_mode_get_handler(httpd_req_t *req)
{
    // 检查权限
    if (basic_auth_get(req) != ESP_OK) {
        return ESP_FAIL;
    }

    // 获取当前网络模式
    network_mode_t current_mode = network_manager_get_mode();
    
    // 返回JSON结果
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    
    char *resp_str = NULL;
    asprintf(&resp_str, "{\"mode\":%d}", current_mode);
    
    httpd_resp_sendstr(req, resp_str);
    free(resp_str);
    
    return ESP_OK;
}

/* MQTT主题列表处理函数 */
static esp_err_t mqtt_topics_get_handler(httpd_req_t *req)
{
    char resp_str[512];
    char topics[MAX_MQTT_TOPICS][64];
    int topic_count = 0;

    // 获取已订阅的主题列表
    esp_err_t ret = mqtt_get_subscribed_topics(topics, MAX_MQTT_TOPICS, &topic_count);
    if (ret != ESP_OK) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"获取主题列表失败\"}");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

    // 创建JSON响应
    cJSON *root = cJSON_CreateObject();
    cJSON_AddBoolToObject(root, "success", true);
    
    cJSON *topics_array = cJSON_AddArrayToObject(root, "topics");
    for (int i = 0; i < topic_count; i++) {
        cJSON_AddItemToArray(topics_array, cJSON_CreateString(topics[i]));
    }

    char *json_str = cJSON_Print(root);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_str, strlen(json_str));
    
    cJSON_Delete(root);
    free(json_str);
    
    return ESP_OK;
}

/* 添加MQTT主题处理函数 */
static esp_err_t mqtt_topic_add_handler(httpd_req_t *req)
{
    int total_len = req->content_len;
    int cur_len = 0;
    char *buf = malloc(total_len + 1);
    if (buf == NULL) {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    
    int received = 0;
    while (cur_len < total_len) {
        received = httpd_req_recv(req, buf + cur_len, total_len - cur_len);
        if (received <= 0) {
            free(buf);
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        cur_len += received;
    }
    buf[total_len] = '\0';

    cJSON *root = cJSON_Parse(buf);
    free(buf);
    
    char resp_str[256];
    
    if (root == NULL) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"无效的JSON数据\"}");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

    cJSON *topic_json = cJSON_GetObjectItem(root, "topic");
    if (!cJSON_IsString(topic_json) || (topic_json->valuestring == NULL)) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"无效的主题\"}");
        cJSON_Delete(root);
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

