slash-tzf/ESP32_MQTT/main/http_server/modem_http_config.c
    // 添加并订阅主题
    esp_err_t ret = mqtt_subscribe_topic(topic_json->valuestring, true);
    cJSON_Delete(root);
    
    if (ret == ESP_OK) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":true,\"message\":\"主题添加成功\"}");
    } else if (ret == ESP_ERR_NO_MEM) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"主题数量已达上限\"}");
    } else {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"主题添加失败\"}");
    }
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp_str, strlen(resp_str));
    
    return ESP_OK;
}

/* 删除MQTT主题处理函数 */
static esp_err_t mqtt_topic_delete_handler(httpd_req_t *req)
{
    int total_len = req->content_len;
    int cur_len = 0;
    char *buf = malloc(total_len + 1);
    if (buf == NULL) {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    
    int received = 0;
    while (cur_len < total_len) {
        received = httpd_req_recv(req, buf + cur_len, total_len - cur_len);
        if (received <= 0) {
            free(buf);
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        cur_len += received;
    }
    buf[total_len] = '\0';

    cJSON *root = cJSON_Parse(buf);
    free(buf);
    
    char resp_str[256];
    
    if (root == NULL) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"无效的JSON数据\"}");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

    cJSON *topic_json = cJSON_GetObjectItem(root, "topic");
    if (!cJSON_IsString(topic_json) || (topic_json->valuestring == NULL)) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"无效的主题\"}");
        cJSON_Delete(root);
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

    // 取消订阅并删除主题
    esp_err_t ret = mqtt_unsubscribe_topic(topic_json->valuestring, true);
    cJSON_Delete(root);
    
    if (ret == ESP_OK) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":true,\"message\":\"主题删除成功\"}");
    } else if (ret == ESP_ERR_NOT_FOUND) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"未找到指定主题\"}");
    } else {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"主题删除失败\"}");
    }
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp_str, strlen(resp_str));
    
    return ESP_OK;
}

/* 发布MQTT消息处理函数 */
static esp_err_t mqtt_publish_handler(httpd_req_t *req)
{
    int total_len = req->content_len;
    int cur_len = 0;
    char *buf = malloc(total_len + 1);
    if (buf == NULL) {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    
    int received = 0;
    while (cur_len < total_len) {
        received = httpd_req_recv(req, buf + cur_len, total_len - cur_len);
        if (received <= 0) {
            free(buf);
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        cur_len += received;
    }
    buf[total_len] = '\0';

    cJSON *root = cJSON_Parse(buf);
    free(buf);
    
    char resp_str[256];
    
    if (root == NULL) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"无效的JSON数据\"}");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

    cJSON *topic_json = cJSON_GetObjectItem(root, "topic");
    cJSON *message_json = cJSON_GetObjectItem(root, "message");
    
    if (!cJSON_IsString(topic_json) || (topic_json->valuestring == NULL) || 
        !cJSON_IsString(message_json) || (message_json->valuestring == NULL)) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"无效的主题或消息\"}");
        cJSON_Delete(root);
        httpd_resp_set_type(req, "application/json");
        httpd_resp_send(req, resp_str, strlen(resp_str));
        return ESP_OK;
    }

    // 发布消息
    esp_err_t ret = mqtt_publish_message(topic_json->valuestring, message_json->valuestring, 1);  // QoS 1
    cJSON_Delete(root);
    
    if (ret == ESP_OK) {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":true,\"message\":\"消息发布成功\"}");
    } else {
        snprintf(resp_str, sizeof(resp_str), "{\"success\":false,\"message\":\"消息发布失败\"}");
    }
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp_str, strlen(resp_str));
    
    return ESP_OK;
}

static httpd_uri_t wlan_general = {
    .uri = "/wlan_general",
    .method = HTTP_GET,
    .handler = wlan_general_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t wlan_general_post = {
    .uri = "/wlan_general",
    .method = HTTP_POST,
    .handler = wlan_general_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t wlan_advance = {
    .uri = "/wlan_advance",
    .method = HTTP_GET,
    .handler = wlan_advance_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t wlan_advance_post = {
    .uri = "/wlan_advance",
    .method = HTTP_POST,
    .handler = wlan_advance_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t system_station_get = {
    .uri = "/system/station_state",
    .method = HTTP_GET,
    .handler = system_station_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t login_get = {
    .uri = "/login",
    .method = HTTP_GET,
    .handler = login_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t login_post = {
    .uri = "/login",
    .method = HTTP_POST,
    .handler = login_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t system_station_delete_device_post = {
    .uri = "/system/station_state/delete_device",
    .method = HTTP_POST,
    .handler = system_station_delete_device_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

