slash-tzf/ESP32_MQTT/main/http_server/modem_http_config.c
static httpd_uri_t system_station_change_name_post = {
    .uri = "/system/station_state/change_name",
    .method = HTTP_POST,
    .handler = system_station_change_name_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t sensors_data_get = {
    .uri       = "/sensors/data",
    .method    = HTTP_GET,
    .handler   = sensors_data_get_handler,
    .user_ctx  = NULL
};

static httpd_uri_t wifi_sta_get = {
    .uri = "/wifi_sta",
    .method = HTTP_GET,
    .handler = wifi_sta_get_handler,
    .user_ctx = NULL
};

static httpd_uri_t wifi_sta_post = {
    .uri = "/wifi_sta",
    .method = HTTP_POST,
    .handler = wifi_sta_post_handler,
    .user_ctx = NULL
};

static httpd_uri_t network_mode_get = {
    .uri = "/network_mode",
    .method = HTTP_GET,
    .handler = network_mode_get_handler,
    .user_ctx = NULL
};

static httpd_uri_t mqtt_topics_uri = {
    .uri       = "/api/mqtt/topics",
    .method    = HTTP_GET,
    .handler   = mqtt_topics_get_handler,
    .user_ctx  = NULL
};

static httpd_uri_t mqtt_add_topic_uri = {
    .uri       = "/api/mqtt/topics/add",
    .method    = HTTP_POST,
    .handler   = mqtt_topic_add_handler,
    .user_ctx  = NULL
};

static httpd_uri_t mqtt_delete_topic_uri = {
    .uri       = "/api/mqtt/topics/delete",
    .method    = HTTP_POST,
    .handler   = mqtt_topic_delete_handler,
    .user_ctx  = NULL
};

static httpd_uri_t mqtt_publish_uri = {
    .uri       = "/api/mqtt/publish",
    .method    = HTTP_POST,
    .handler   = mqtt_publish_handler,
    .user_ctx  = NULL
};

static httpd_handle_t start_webserver(const char *base_path)
{
    ctx_info_t *ctx_info = calloc(1, sizeof(ctx_info_t));
    REST_CHECK(base_path, "wrong base path", err);
    ctx_info->rest_context = calloc(1, sizeof(rest_server_context_t));
    REST_CHECK(ctx_info->rest_context, "No memory for rest context", err);
    strlcpy(ctx_info->rest_context->base_path, base_path, sizeof(ctx_info->rest_context->base_path));

    ctx_info->basic_auth_info = calloc(1, sizeof(basic_auth_info_t));
    ctx_info->basic_auth_info->username = CONFIG_EXAMPLE_WEB_USERNAME;
    ctx_info->basic_auth_info->password = CONFIG_EXAMPLE_WEB_PASSWORD;

    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.stack_size = 8192;
    config.max_uri_handlers = 20;
    config.lru_purge_enable = true;
    config.uri_match_fn = httpd_uri_match_wildcard;

    // Start the httpd server
    ESP_LOGI(TAG, "Starting server on port: '%d'", config.server_port);

    if (httpd_start(&server, &config) == ESP_OK) {

        // Set URI handlers & Add user_ctx
        ESP_LOGI(TAG, "Registering URI handlers");
        wlan_general.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &wlan_general);
        wlan_general_post.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &wlan_general_post);
        wlan_advance.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &wlan_advance);
        wlan_advance_post.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &wlan_advance_post);
        system_station_get.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &system_station_get);
        system_station_delete_device_post.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &system_station_delete_device_post);
        system_station_change_name_post.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &system_station_change_name_post);
        login_get.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &login_get);
        login_post.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &login_post);
        sensors_data_get.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &sensors_data_get);
        wifi_sta_get.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &wifi_sta_get);
        wifi_sta_post.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &wifi_sta_post);
        network_mode_get.user_ctx = ctx_info;
        httpd_register_uri_handler(server, &network_mode_get);

        httpd_register_uri_handler(server, &mqtt_topics_uri);
        
        httpd_register_uri_handler(server, &mqtt_add_topic_uri);
        
        httpd_register_uri_handler(server, &mqtt_delete_topic_uri);
        
        httpd_register_uri_handler(server, &mqtt_publish_uri);
        
        httpd_uri_t common_get_uri = {
            .uri = "/*",
            .method = HTTP_GET,
            .handler = rest_common_get_handler,
            .user_ctx = ctx_info
        };
        httpd_register_uri_handler(server, &common_get_uri);

        return server;
    }

    ESP_LOGE(TAG, "Error starting server!");
    return NULL;
err:
    return NULL;
}

static void stop_webserver(httpd_handle_t server)
{
    // Stop the httpd server
    httpd_stop(server);
}

static bool s_if_init = false;

esp_err_t modem_http_get_nvs_wifi_config(modem_wifi_config_t *wifi_config)
{
    char str[64] = "";
    size_t str_size = sizeof(str);

    esp_err_t err = from_nvs_get_value("ssid", str, &str_size);
    if ( err == ESP_OK ) {
        strncpy(wifi_config->ssid, str, str_size);
    }
    str_size = sizeof(str);

    err = from_nvs_get_value("password", str, &str_size);
    if ( err == ESP_OK ) {
        strncpy(wifi_config->password, str, sizeof(wifi_config->password));
    }
    str_size = sizeof(str);

    err = from_nvs_get_value("auth_mode", str, &str_size);
    if ( err == ESP_OK ) {
         if ( !strcmp(str, "OPEN") ) {
            wifi_config->authmode = WIFI_AUTH_OPEN;
        } else if ( !strcmp(str, "WEP") ) {
            wifi_config->authmode = WIFI_AUTH_WEP;
        } else if ( !strcmp(str, "WPA2_PSK") ) {
            wifi_config->authmode = WIFI_AUTH_WPA2_PSK;
        } else if ( !strcmp(str, "WPA_WPA2_PSK") ) {
            wifi_config->authmode = WIFI_AUTH_WPA_WPA2_PSK;
        } else {
            ESP_LOGE(TAG, "auth_mode %s is not define", str);
        }
    }
    str_size = sizeof(str);

    err = from_nvs_get_value("channel", str, &str_size);
    if ( err == ESP_OK ) {
        wifi_config->channel = atoi(str);
    }
    str_size = sizeof(str);

    from_nvs_get_value("hide_ssid", str, &str_size);
    if ( err == ESP_OK ) {
        if ( !strcmp(str, "true") ) {
            wifi_config->ssid_hidden = 1;
        } else {
            wifi_config->ssid_hidden = 0;
        }
    }
    str_size = sizeof(str);

